z-mnp-test/misc/PinCode/PortOutServiceServiceSoapBinding/generatePinCode/1.x om.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:por="http://portout.ws.pincode.mnp.cat">
   <soapenv:Header/>
   <soapenv:Body>
      <por:generatePinCode>
         <por:channelType>WEBSITE</por:channelType>
         <por:channelRefNumber>123456789012345</por:channelRefNumber>
         <por:customerType>INDIVIDUAL</por:customerType>
         <por:cardNumber>1122233333445</por:cardNumber>
         <por:msisdnList>
            <por:msisdn>0909380000</por:msisdn>
         </por:msisdnList>
         <por:contactChannelType>SMS</por:contactChannelType>
         <por:contactEmailAddress></por:contactEmailAddress>
         <por:contactMsisdn>0909380000</por:contactMsisdn>
      </por:generatePinCode>
   </soapenv:Body>
</soapenv:Envelope>