z-mnp-test/misc/PinCode/PortOutServiceServiceSoapBinding/generatePinCode/organization.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:por="http://portout.ws.pincode.mnp.cat">
   <soapenv:Header/>
   <soapenv:Body>
      <por:generatePinCode>
         <por:channelType>WEBSITE</por:channelType>
         <por:channelRefNumber>2234567890104860468</por:channelRefNumber>
         <por:customerType>ORGANIZATION</por:customerType>
         <por:cardNumber>0245698761428</por:cardNumber>
         <por:msisdnList>
            <por:msisdn>0864719901</por:msisdn>
            <por:msisdn>0864719902</por:msisdn>
            <por:msisdn>0864719903</por:msisdn>
            <por:msisdn>0864719904</por:msisdn>
            <por:msisdn>0864719905</por:msisdn>
            <por:msisdn>0864719906</por:msisdn>
            <por:msisdn>0864719907</por:msisdn>
            <por:msisdn>0864719908</por:msisdn>
            <por:msisdn>0864719909</por:msisdn>
            <por:msisdn>0864719910</por:msisdn>
            <por:msisdn>0864719911</por:msisdn>
            <por:msisdn>0864719912</por:msisdn>
            <por:msisdn>0864719913</por:msisdn>
            <por:msisdn>0864719914</por:msisdn>
            <por:msisdn>0864719915</por:msisdn>
            <por:msisdn>0864719916</por:msisdn>
            <por:msisdn>0864719917</por:msisdn>
            <por:msisdn>0864719918</por:msisdn>
            <por:msisdn>0864719919</por:msisdn>
            <por:msisdn>0864719920</por:msisdn>
            <por:msisdn>0864719921</por:msisdn>
            <por:msisdn>0864719922</por:msisdn>
            <por:msisdn>0864719923</por:msisdn>
            <por:msisdn>0864719924</por:msisdn>
            <por:msisdn>0864719925</por:msisdn>
            <por:msisdn>0864719926</por:msisdn>
            <por:msisdn>0864719927</por:msisdn>
            <por:msisdn>0864719928</por:msisdn>
            <por:msisdn>0864719929</por:msisdn>
            <por:msisdn>0864719930</por:msisdn>
            <por:msisdn>0864719931</por:msisdn>
            <por:msisdn>0864719932</por:msisdn>
            <por:msisdn>0864719933</por:msisdn>
            <por:msisdn>0864719934</por:msisdn>
            <por:msisdn>0864719935</por:msisdn>
            <por:msisdn>0864719936</por:msisdn>
            <por:msisdn>0864719937</por:msisdn>
            <por:msisdn>0864719938</por:msisdn>
            <por:msisdn>0864719939</por:msisdn>
            <por:msisdn>0864719940</por:msisdn>
            <por:msisdn>0864719941</por:msisdn>
            <por:msisdn>0864719942</por:msisdn>
            <por:msisdn>0864719943</por:msisdn>
            <por:msisdn>0864719944</por:msisdn>
            <por:msisdn>0864719945</por:msisdn>
            <por:msisdn>0864719946</por:msisdn>
            <por:msisdn>0864719947</por:msisdn>
            <por:msisdn>0864719948</por:msisdn>
            <por:msisdn>0864719949</por:msisdn>
            <por:msisdn>0864719950</por:msisdn>
            <por:msisdn>0864719951</por:msisdn>
            <por:msisdn>0864719952</por:msisdn>
            <por:msisdn>0864719953</por:msisdn>
            <por:msisdn>0864719954</por:msisdn>
            <por:msisdn>0864719955</por:msisdn>
            <por:msisdn>0864719956</por:msisdn>
            <por:msisdn>0864719957</por:msisdn>
            <por:msisdn>0864719958</por:msisdn>
            <por:msisdn>0864719959</por:msisdn>
            <por:msisdn>0864719960</por:msisdn>
            <por:msisdn>0864719961</por:msisdn>
            <por:msisdn>0864719962</por:msisdn>
            <por:msisdn>0864719963</por:msisdn>
            <por:msisdn>0864719964</por:msisdn>
            <por:msisdn>0864719965</por:msisdn>
            <por:msisdn>0864719966</por:msisdn>
            <por:msisdn>0864719967</por:msisdn>
            <por:msisdn>0864719968</por:msisdn>
            <por:msisdn>0864719969</por:msisdn>
            <por:msisdn>0864719970</por:msisdn>
            <por:msisdn>0864719971</por:msisdn>
            <por:msisdn>0864719972</por:msisdn>
            <por:msisdn>0864719973</por:msisdn>
            <por:msisdn>0864719974</por:msisdn>
            <por:msisdn>0864719975</por:msisdn>
            <por:msisdn>0864719976</por:msisdn>
            <por:msisdn>0864719977</por:msisdn>
            <por:msisdn>0864719978</por:msisdn>
            <por:msisdn>0864719979</por:msisdn>
            <por:msisdn>0864719980</por:msisdn>
            <por:msisdn>0864719981</por:msisdn>
            <por:msisdn>0864719982</por:msisdn>
            <por:msisdn>0864719983</por:msisdn>
            <por:msisdn>0864719984</por:msisdn>
            <por:msisdn>0864719985</por:msisdn>
            <por:msisdn>0864719986</por:msisdn>
            <por:msisdn>0864719987</por:msisdn>
            <por:msisdn>0864719988</por:msisdn>
            <por:msisdn>0864719989</por:msisdn>
            <por:msisdn>0864719990</por:msisdn>
            <por:msisdn>0864719991</por:msisdn>
            <por:msisdn>0864719992</por:msisdn>
            <por:msisdn>0864719993</por:msisdn>
            <por:msisdn>0864719994</por:msisdn>
            <por:msisdn>0864719995</por:msisdn>
            <por:msisdn>0864719996</por:msisdn>
            <por:msisdn>0864719997</por:msisdn>
            <por:msisdn>0864719998</por:msisdn>
            <por:msisdn>0864719999</por:msisdn>
            <por:msisdn>0864720000</por:msisdn>
            <por:msisdn>0864720001</por:msisdn>
            <por:msisdn>0864720002</por:msisdn>
            <por:msisdn>0864720003</por:msisdn>
            <por:msisdn>0864720004</por:msisdn>
            <por:msisdn>0864720005</por:msisdn>
            <por:msisdn>0864720006</por:msisdn>
            <por:msisdn>0864720007</por:msisdn>
            <por:msisdn>0864720008</por:msisdn>
            <por:msisdn>0864720009</por:msisdn>
            <por:msisdn>0864720010</por:msisdn>
            <por:msisdn>0864720011</por:msisdn>
            <por:msisdn>0864720012</por:msisdn>
            <por:msisdn>0864720013</por:msisdn>
            <por:msisdn>0864720014</por:msisdn>
            <por:msisdn>0864720015</por:msisdn>
            <por:msisdn>0864720016</por:msisdn>
            <por:msisdn>0864720017</por:msisdn>
            <por:msisdn>0864720018</por:msisdn>
            <por:msisdn>0864720019</por:msisdn>
            <por:msisdn>0864720020</por:msisdn>
            <por:msisdn>0864720021</por:msisdn>
            <por:msisdn>0864720022</por:msisdn>
            <por:msisdn>0864720023</por:msisdn>
            <por:msisdn>0864720024</por:msisdn>
            <por:msisdn>0864720025</por:msisdn>
            <por:msisdn>0864720026</por:msisdn>
            <por:msisdn>0864720027</por:msisdn>
            <por:msisdn>0864720028</por:msisdn>
            <por:msisdn>0864720029</por:msisdn>
            <por:msisdn>0864720030</por:msisdn>
            <por:msisdn>0864720031</por:msisdn>
            <por:msisdn>0864720032</por:msisdn>
            <por:msisdn>0864720033</por:msisdn>
            <por:msisdn>0864720034</por:msisdn>
            <por:msisdn>0864720035</por:msisdn>
            <por:msisdn>0864720036</por:msisdn>
            <por:msisdn>0864720037</por:msisdn>
            <por:msisdn>0864720038</por:msisdn>
            <por:msisdn>0864720039</por:msisdn>
            <por:msisdn>0864720040</por:msisdn>
            <por:msisdn>0864720041</por:msisdn>
            <por:msisdn>0864720042</por:msisdn>
            <por:msisdn>0864720043</por:msisdn>
            <por:msisdn>0864720044</por:msisdn>
            <por:msisdn>0864720045</por:msisdn>
            <por:msisdn>0864720046</por:msisdn>
            <por:msisdn>0864720047</por:msisdn>
            <por:msisdn>0864720048</por:msisdn>
            <por:msisdn>0864720049</por:msisdn>
            <por:msisdn>0864720050</por:msisdn>
            <por:msisdn>0864720051</por:msisdn>
            <por:msisdn>0864720052</por:msisdn>
            <por:msisdn>0864720053</por:msisdn>
            <por:msisdn>0864720054</por:msisdn>
            <por:msisdn>0864720055</por:msisdn>
            <por:msisdn>0864720056</por:msisdn>
            <por:msisdn>0864720057</por:msisdn>
            <por:msisdn>0864720058</por:msisdn>
            <por:msisdn>0864720059</por:msisdn>
            <por:msisdn>0864720060</por:msisdn>
            <por:msisdn>0864720061</por:msisdn>
            <por:msisdn>0864720062</por:msisdn>
            <por:msisdn>0864720063</por:msisdn>
            <por:msisdn>0864720064</por:msisdn>
            <por:msisdn>0864720065</por:msisdn>
            <por:msisdn>0864720066</por:msisdn>
            <por:msisdn>0864720067</por:msisdn>
            <por:msisdn>0864720068</por:msisdn>
            <por:msisdn>0864720069</por:msisdn>
            <por:msisdn>0864720070</por:msisdn>
            <por:msisdn>0864720071</por:msisdn>
            <por:msisdn>0864720072</por:msisdn>
            <por:msisdn>0864720073</por:msisdn>
            <por:msisdn>0864720074</por:msisdn>
            <por:msisdn>0864720075</por:msisdn>
            <por:msisdn>0864720076</por:msisdn>
            <por:msisdn>0864720077</por:msisdn>
            <por:msisdn>0864720078</por:msisdn>
            <por:msisdn>0864720079</por:msisdn>
            <por:msisdn>0864720080</por:msisdn>
            <por:msisdn>0864720081</por:msisdn>
            <por:msisdn>0864720082</por:msisdn>
            <por:msisdn>0864720083</por:msisdn>
            <por:msisdn>0864720084</por:msisdn>
            <por:msisdn>0864720085</por:msisdn>
            <por:msisdn>0864720086</por:msisdn>
            <por:msisdn>0864720087</por:msisdn>
            <por:msisdn>0864720088</por:msisdn>
            <por:msisdn>0864720089</por:msisdn>
            <por:msisdn>0864720090</por:msisdn>
            <por:msisdn>0864720091</por:msisdn>
            <por:msisdn>0864720092</por:msisdn>
            <por:msisdn>0864720093</por:msisdn>
            <por:msisdn>0864720094</por:msisdn>
            <por:msisdn>0864720095</por:msisdn>
            <por:msisdn>0864720096</por:msisdn>
            <por:msisdn>0864720097</por:msisdn>
            <por:msisdn>0864720098</por:msisdn>
            <por:msisdn>0864720099</por:msisdn>
            <por:msisdn>0864720100</por:msisdn>
            <por:msisdn>0864720101</por:msisdn>
            <por:msisdn>0864720102</por:msisdn>
            <por:msisdn>0864720103</por:msisdn>
            <por:msisdn>0864720104</por:msisdn>
            <por:msisdn>0864720105</por:msisdn>
            <por:msisdn>0864720106</por:msisdn>
            <por:msisdn>0864720107</por:msisdn>
            <por:msisdn>0864720108</por:msisdn>
            <por:msisdn>0864720109</por:msisdn>
            <por:msisdn>0864720110</por:msisdn>
            <por:msisdn>0864720111</por:msisdn>
            <por:msisdn>0864720112</por:msisdn>
            <por:msisdn>0864720113</por:msisdn>
            <por:msisdn>0864720114</por:msisdn>
            <por:msisdn>0864720115</por:msisdn>
            <por:msisdn>0864720116</por:msisdn>
            <por:msisdn>0864720117</por:msisdn>
            <por:msisdn>0864720118</por:msisdn>
            <por:msisdn>0864720119</por:msisdn>
            <por:msisdn>0864720120</por:msisdn>
            <por:msisdn>0864720121</por:msisdn>
            <por:msisdn>0864720122</por:msisdn>
            <por:msisdn>0864720123</por:msisdn>
            <por:msisdn>0864720124</por:msisdn>
            <por:msisdn>0864720125</por:msisdn>
            <por:msisdn>0864720126</por:msisdn>
            <por:msisdn>0864720127</por:msisdn>
            <por:msisdn>0864720128</por:msisdn>
            <por:msisdn>0864720129</por:msisdn>
            <por:msisdn>0864720130</por:msisdn>
            <por:msisdn>0864720131</por:msisdn>
            <por:msisdn>0864720132</por:msisdn>
            <por:msisdn>0864720133</por:msisdn>
            <por:msisdn>0864720134</por:msisdn>
            <por:msisdn>0864720135</por:msisdn>
            <por:msisdn>0864720136</por:msisdn>
            <por:msisdn>0864720137</por:msisdn>
            <por:msisdn>0864720138</por:msisdn>
            <por:msisdn>0864720139</por:msisdn>
            <por:msisdn>0864720140</por:msisdn>
            <por:msisdn>0864720141</por:msisdn>
            <por:msisdn>0864720142</por:msisdn>
            <por:msisdn>0864720143</por:msisdn>
            <por:msisdn>0864720144</por:msisdn>
            <por:msisdn>0864720145</por:msisdn>
            <por:msisdn>0864720146</por:msisdn>
            <por:msisdn>0864720147</por:msisdn>
            <por:msisdn>0864720148</por:msisdn>
            <por:msisdn>0864720149</por:msisdn>
            <por:msisdn>0864720150</por:msisdn>
         </por:msisdnList>
         <por:contactChannelType>EMAIL</por:contactChannelType>
         <por:contactEmailAddress>anuchitr@ou.com</por:contactEmailAddress>
         <por:contactMsisdn>0864926023</por:contactMsisdn>
      </por:generatePinCode>
   </soapenv:Body>
</soapenv:Envelope>